geomatsi/mcu-tests/t-dongle-s3-rgb-test1/sdkconfig.defaults
# default target: esp32s3
CONFIG_IDF_TARGET_ARCH_X=y
CONFIG_IDF_TARGET_ARCH="xtensa"
CONFIG_IDF_TARGET="esp32s3"
CONFIG_IDF_TARGET_ESP32S3=y
